# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
# потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.
# Пояснення:
# [0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88
# [1, 3, 5] => 30
# [6] => 36
# [] => 0

numbers = [0, 1, 7, 2, 4, 8]
num_lst = len(numbers)
sum_num = 0
for i in range(0, num_lst, 2):
    sum_num += numbers[i]
if num_lst > 0:
    print(sum_num * numbers[-1])
else:
    print(num_lst)

