# 1. Квадрат числа.
# Користувач вводить число. Програма виводить його квадрат.
# Приклад:
# Введіть число: 5
# Квадрат числа: 25

# Answer
# number = int(input("Enter your number: "))
# print(number ** 2)


# 2. “Середнє трьох чисел”
# Програма запитує три числа і виводить їх середнє арифметичне.
# Приклад:
# Введіть три числа: 2, 4, 6
# Середнє: 4.0

# Answer
# num_value = int(input("Enter your three numbers: "))

# num1 = num_value // 100
# num2 = num_value % 100 // 10
# num3 = num_value % 10
# sum_numbers = num1 + num2 + num3

# print(sum_numbers / 3)


# 3. “Перетворення хвилин у години”
# Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.
# Приклад:
# Введіть кількість хвилин: 135
# 2 години 15 хвилин

# Answer
# amount_minutes = int(input("Enter your minutes: "))
# hours = amount_minutes // 60
# minutes = amount_minutes % 60
# print(f"{hours} години {minutes} хвилин")


# 4. “Розрахунок знижки”
# Користувач вводить ціну товару і розмір знижки у %.
# Програма виводить кінцеву ціну.
# Приклад:
# Введіть ціну: 1000
# Введіть знижку (%): 15
# Ціна зі знижкою: 850.0

# Answer
# price = int(input("Enter your price: "))
# discount = int(input("Enter your discount(%): "))
# total = price - (price * discount / 100)
# print(total)


# 5. “Остання цифра числа”
# Користувач вводить ціле число, програма виводить його останню цифру.
# Приклад:
# Введіть число: 347
# Остання цифра: 7

# Answer
# number = int(input("Enter your number: "))
# last_num = number % 10
# print(last_num)


# 6. “Периметр прямокутника”
# Користувач вводить довжину і ширину. Програма виводить периметр.
# Приклад:
# Введіть довжину: 5
# Введіть ширину: 3
# Периметр: 16

# Answer
# length = int(input("Enter your length rectangle: "))
# width = int(input("Enter your width rectangle: "))
# total = (length + width) * 2
# print(total)


# 7. Виведення числа в стовпчик
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр,
# з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
# 1
# 2
# 3
# 4
# Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod).
# Виведення в стовпчик можна зробити за допомогою 4-х функцій print.

# Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число, яке складається з 4-х цифр,
# де кожна цифра може бути від 0 до 9 включно.
# Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.
# Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-х значне.

# number = int(input("Enter your four numbers: "))
# num_1 = number // 1000
# num_2 = number % 1000 // 100
# num_3 = number % 100 // 10
# num_4 = number % 10
# print(num_1)
# print(num_2)
# print(num_3)
# print(num_4)
